sys394-isd.tex
% Created 2016-02-02 Tue 21:53
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{booktabs}
\usepackage[margin=1.5in]{geometry}
\usepackage{lastpage}
\usepackage{fancyhdr}
\pagestyle{fancy}
\lhead{SYS 394---Information Systems Design}
\chead{}
\rhead{Course Syllabus}
\lfoot{Spring 2016}
\cfoot{}
\rfoot{Page \thepage\ of \pageref{LastPage}}
\renewcommand{\headrulewidth}{0.4pt}
\renewcommand{\footrulewidth}{0.4pt}
\renewcommand\maketitle\relax
\date{Spring, 2016}
\title{SYS 394---Information Systems Design}
\hypersetup{
 pdfauthor={Tom Nurkkala},
 pdftitle={SYS 394---Information Systems Design},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.3)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Instructor}
\label{sec:orgheadline1}
\textbf{Dr. Tom Nurkkala}\\
Associate Professor, Computer Science and Engineering\\
Director, Taylor Center for Missions Computing\\
Office: Euler Science Complex 211\\
E-Mail: \texttt{tnurkkala@cse.taylor.edu}\\
Phone: 8-5163\\
Hours: MW~2:00-4:00, R~1:00-2:00, or by appointment\\
\section{Course Overview}
\label{sec:orgheadline2}
The course focuses on the physical design and construction phases
of the system development life cycle.
Our goal is to implement a working prototype
of the system defined and analyzed in SYS 390 (ISA)
as a database-backed web application.
We will cover web and database programming, advanced SQL topics,
software project management practices, system architecture,
and related web technology.

The course comprises two hands-on, lab-heavy segments.
\begin{enumerate}
\item For approximately the first five weeks, we will focus on the basics of developing a
database-backed web application. This portion of the course is designed to provide
everyone in the class with the knowledge and skills necessary to understand and
construct a non-trivial web application. We will cover salient topics in class, and you
will complete a series of lab exercises that give you practice with the topic of the
day.
\item For the remaining ten weeks of the course, you will be working on constructing a
prototype application that implements the requirements you gathered in ISA as reflected
in your System Requirements Specification (ISA).
\end{enumerate}
\section{Learning Objectives}
\label{sec:orgheadline3}
When you complete this class you should be able to:
\begin{enumerate}
\item Understand the importance of a formal system development methodology to information
technology project success
\item Learn how to translate a logical design to a physical design
\item Apply user interface design skills
\item Employ agile software project management practices and tools
\item Participate effectively on a software development team
\item Demonstrate relational database skills in both SQL data definition and data manipulation
\item Use key technologies powering modern web applications: three-tier architecture, web pages,
development tools, and servers
\item Apply testing skills, including unit tests and client-side GUI tests
\item Present effectively the results of your work to others
\end{enumerate}
\section{Text}
\label{sec:orgheadline4}
There is no required text for the course.
\section{Project}
\label{sec:orgheadline9}
We will continue the project begun in ISA. Our goal is to build working prototypes of a
system that implements the bulk of the system you envisioned in your SRS in ISA.
\subsection{Teams}
\label{sec:orgheadline5}
Again this semester, you will work in teams,
typically comprising 3-5 students.
Unlike ISA, however, I will select the members of the teams
in order to ensure each team has a fair balance
of technical and non-technical expertise.

I will distribute a brief survey early in the semester
that will help me gauge your technical background.
The survey also asks you to indicate who you would---and would not---like
to have on your team.
Although a good balance of skills will trump your personal preferences,
I do my best to honor your request.
\subsection{Development Process}
\label{sec:orgheadline6}
Teams will employ a development process
based on the standard agile process known as \emph{Scrum}.
We will employ an iterative approach to project development
in which your team will focus on delivering
small increments of functionality
that provide both you and me a clear and demonstrable indication of your progress.

As in ISA, \textbf{procrastination is the enemy}.
Using an agile, iterative process forces you and your team
regularly to deliver working software,
which not only gives you a clear view of your accomplishments,
but helps stem the tide of procrastination.
\subsection{Show-and-Tell}
\label{sec:orgheadline7}
At the end of the semester, we will have a ``show and tell'' time,
during which you will demonstrate your prototype application.
Our customer will be invited to join us for your demonstrations,
either in person or electronically.

Although this presentation is not \emph{nearly} as formal as your final presentation in ISA,
it is nonetheless your opportunity to show off the fruit of a year of your labor.
Begin the semester with this end in mind,
and stay focused on delivering an excellent and exciting final product!
\subsection{Technology}
\label{sec:orgheadline8}
We will be building the project prototypes using
standard tools and libraries in the Python ecosystem.
Thus, you will be able to leverage your experience
from COS~120 and any other exposure you've had to Python.
\section{Classroom Expectations}
\label{sec:orgheadline13}
Following are my expectations about classroom conduct.
\subsection{Attendance}
\label{sec:orgheadline10}
Attendance is required. I will be in class each day,
and I expect you to be there also.
I will log who attends each class session.

In general, I am very understanding about students who must miss class
due to a sanctioned Taylor activity, job interview, family emergency, and the like.
If possible, let me know in advance if you will not be in class.
I will work with you to arrange make-up instruction, homework, exams, etc.
\subsection{Conduct}
\label{sec:orgheadline11}
I expect you to be prepared, awake, aware, and participatory during class.
I will not hesitate to ask you to stand or move if you are distracted or sleepy.

I expect you to join in discussions,
respond to questions from me and from your colleagues,
and ask questions of me.
I expect you to hold my feet to the fire
if I am being unclear, unkind, or contradictory.
\subsection{Gizmos}
\label{sec:orgheadline12}
You may not use a laptop, tablet, or similar device
to check e-mail, engage in social networking, surf the web,
or any other activity not directly relevant to current classroom activity.

If you use an electronic gizmo during class
for legitimate academic purposes (e.g., note taking),
be prepared to demonstrate relevant use on demand at any time.
\section{Moodle}
\label{sec:orgheadline14}
The Computer Science and Engineering department uses Moodle as our Learning Management
System. The URL for Moodle is \url{https://moodle.cse.taylor.edu}. To sign on to the course site
for the first time, you will need an enrollment key. The key for this course is
\texttt{nerds4christ}.

You are responsible for checking Moodle regularly to keep up with assignment due dates and
other announcements posted to the site. For due dates, \emph{the Moodle calendar is your friend}.
\section{Evaluation}
\label{sec:orgheadline15}
The grading scheme for the course will be announced in the next few days.

\section{Academic Integrity}
\label{sec:orgheadline16}
As a student at an institution whose goal is to honor Christ in all that it does,
I expect you to uphold the strictest standards of academic integrity.
You must do your own work,
cite others when you present their work,
and never misrepresent your academic performance in any way.
Violation of these standards stains the reputations
of you as a student,
Taylor as an institution,
and Jesus as our Lord.
Such a violation will result in your failing the course
and other disciplinary action by the University.
Refer to the Taylor catalog for the official statement of these issues.
\end{document}
%%% Local Variables:
%%% mode: latex
%%% TeX-master: t
%%% End:
